In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Lendo os dados do uber
uber_data = pd.read_csv("uberdrive.csv")
uber_data

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

**A intenção deste projeto é treinar os conceitos de análise de dados com python com dados reais e respondendo perguntas sobre o dataframe. Vamos começar!**

**Q1. Vamos pegar os 10 últimos e os 10 primeiros resultados do dataframe**

In [3]:
# Para isso utilizamos o comendo tail até 10
uber_data.tail(10)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1146,12/30/2016 11:31,12/30/2016 11:56,Business,Karachi,Karachi,2.9,Errand/Supplies
1147,12/30/2016 15:41,12/30/2016 16:03,Business,Karachi,Karachi,4.6,Errand/Supplies
1148,12/30/2016 16:45,12/30/2016 17:08,Business,Karachi,Karachi,4.6,Meeting
1149,12/30/2016 23:06,12/30/2016 23:10,Business,Karachi,Karachi,0.8,Customer Visit
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Karachi,Karachi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [4]:
#para pegar os 10 primeiros utilizamos o head
uber_data.head(10)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,01-06-2016 17:15,01-06-2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
6,01-06-2016 17:30,01-06-2016 17:35,Business,West Palm Beach,Palm Beach,7.1,Meeting
7,01-07-2016 13:27,01-07-2016 13:33,Business,Cary,Cary,0.8,Meeting
8,01-10-2016 08:05,01-10-2016 08:25,Business,Cary,Morrisville,8.3,Meeting
9,01-10-2016 12:17,01-10-2016 12:44,Business,Jamaica,New York,16.5,Customer Visit

**Vamos ver a dimensão e tomanho do dataframe**

In [5]:
# Podemos utilizar o comando shape para isso, sabemos que tem 1156 linhas e 7 colunas
uber_data.shape

(1156, 7)

In [6]:
# utilizamos o comando size para isso
uber_data.size

8092

**Print the information about all the variables of the data set**

In [7]:
uber_data.dtypes
uber_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1156 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

Check for missing values.

In [8]:
# Verificando se há valores nulos no dataframe
uber_data.isna().values.any()

True

How many missing values are present?

In [9]:
# Somando a quantidade de valores presentes no dataframe
uber_data.isna().values.sum()
# Aqui da o total como tabela
uber_data.isna().sum()

START_DATE*      0
END_DATE*        1
CATEGORY*        1
START*           1
STOP*            1
MILES*           0
PURPOSE*       503
dtype: int64

Get the initial data (name it 'df') with dropping the NA values.

In [10]:
uber_df = uber_data.dropna()
# Verificando se ainda valores nulos 
uber_df.isna().values.any()

False

In [11]:
uber_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 653 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  653 non-null    object
 1   END_DATE*    653 non-null    object
 2   CATEGORY*    653 non-null    object
 3   START*       653 non-null    object
 4   STOP*        653 non-null    object
 5   MILES*       653 non-null    float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 40.8+ KB

Get the unique start destinations. (2 points)
Note: This question is based on the dataframe with no 'na' values in the 'START' variable.

In [12]:
# Podemos fazer removendo os dados nulos e transformando em um conjunto para ordenar
set(uber_data["START*"].dropna())

# Ou utilizar o metodo unique diretamente
unique_starts = set(uber_data["START*"].unique())

What is the total number of unique start destinations?

In [13]:
# Como unique-starts é um conjunto, posso contar o número de elementos presentes no conjunto com o len
len(unique_starts)

177

 Print all the Uber trips that has the starting point of San Francisco.

In [14]:
# Podemos acessar na coluna Start a cidada San Francisco como abaixo:
start_san_fransisco = uber_data[uber_data["START*"]=="San Francisco"]
start_san_fransisco

# Ou também utilizando o método loc, no qual ficaria assim:
start_san_fransisco_loc = uber_data.loc[uber_data["START*"]=="San Francisco"]
start_san_fransisco_loc

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
362,05-09-2016 14:39,05-09-2016 15:06,Business,San Francisco,Palo Alto,20.5,Between Offices
440,6/14/2016 16:09,6/14/2016 16:39,Business,San Francisco,Emeryville,11.6,Meeting
836,10/19/2016 14:02,10/19/2016 14:31,Business,San Francisco,Berkeley,10.8,NaN
917,11-07-2016 19:17,11-07-2016 19:57,Business,San Francisco,Berkeley,13.2,Between Offices
919,11-08-2016 12:16,11-08-2016 12:49,Business,San Francisco,Berkeley,11.3,Meeting
927,11-09-2016 18:40,11-09-2016 19:17,Business,San Francisco,Oakland,12.7,Customer Visit
933,11-10-2016 15:17,11-10-2016 15:22,Business,San Francisco,Oakland,9.9,Temporary Site
966,11/15/2016 20:44,11/15/2016 21:00,Business,San Francisco,Berkeley,11.8,Temporary Site

**What is the most popular starting point for the Uber drivers?**

In [15]:
starting_point = uber_data["START*"].dropna()
starting_point.value_counts()
df_starting_point = pd.DataFrame(starting_point.value_counts())
df_starting_point

                   START*
Cary                  201
Unknown Location      148
Morrisville            85
Whitebridge            68
Islamabad              57
...                   ...
Ridgeland               1
Daytona Beach           1
Sky Lake                1
Sand Lake Commons       1
Gampaha                 1

[176 rows x 1 columns]

In [16]:
# Aqui também podemos chegar a mesma conclusão que o código anterior
df_starting_point.sort_values(["START*"],ascending=False)

                  START*
Cary                 201
Unknown Location     148
Morrisville           85
Whitebridge           68
Islamabad             57
...                  ...
Winston Salem          1
Arlington              1
Krendle Woods          1
Columbia Heights       1
Gampaha                1

[176 rows x 1 columns]

In [17]:
# Mas a parte mais fácil e rápida é:
starting_point = pd.DataFrame(uber_data["START*"].value_counts().head(10))
starting_point

                  START*
Cary                 201
Unknown Location     148
Morrisville           85
Whitebridge           68
Islamabad             57
Durham                37
Lahore                36
Karachi               31
Raleigh               28
Westpark Place        17

**What is the most popular dropping point for the Uber drivers?** (2 points)

In [18]:
# É a mesma lógica, só que para os pontos de largada:
dropping_point = pd.DataFrame(uber_data["STOP*"].value_counts().head(10))
dropping_point

                  STOP*
Cary                203
Unknown Location    149
Morrisville          84
Whitebridge          65
Islamabad            58
Durham               36
Lahore               36
Raleigh              29
Karachi              28
Apex                 17

**List the most frequent route taken by Uber drivers. (3 points)**

In [26]:
route_uber = uber_data.dropna()
route_uber = pd.DataFrame(uber_data.groupby(["START*","STOP*"]).size()).head(10).sort_values(0,ascending=False)
route_uber.rename(columns={0:"Count"})
# route_uber.sort_values(by=0,ascending=False)

                         Count
START*    STOP*
Apex      Cary              13
Agnew     Renaissance        2
Apex      Apex               2
Agnew     Agnew              1
          Cory               1
Almond    Bryson City        1
Apex      Eagle Rock         1
          Holly Springs      1
Arabi     Metairie           1
Arlington Washington         1